lains/stm32-linky-display/src/hal/Stm32DebugOutput.cpp
#include "Stm32DebugOutput.h"
extern "C" {
#include "main.h"
}

Stm32DebugOutput::Stm32DebugOutput() : inError(true) {
    this->handle.Instance = nullptr;
}

void Stm32DebugOutput::start() {
    this->inError = false;
    this->handle.Instance = USART_DBG;
    this->handle.Init.BaudRate = 115200;
    this->handle.Init.WordLength = UART_WORDLENGTH_8B;
    this->handle.Init.StopBits = UART_STOPBITS_1;
    this->handle.Init.Parity = UART_PARITY_NONE;
    this->handle.Init.Mode = UART_MODE_TX_RX;
    this->handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    this->handle.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_DeInit(&(this->handle)); /* This will call HAL_UART_MspDeInit() */
    if (HAL_UART_Init(&(this->handle)) != HAL_OK) { /* This will call HAL_UART_MspInit() */
        this->inError = true;
        return;
    }
}
Stm32DebugOutput& Stm32DebugOutput::get() {
    return Stm32DebugOutput::instance;
}

bool Stm32DebugOutput::send(const uint8_t* buffer, unsigned int len) {
    if (this->inError) return false;
    HAL_StatusTypeDef result = HAL_UART_Transmit(&(this->handle), (uint8_t*)buffer, len, 5000);
    if (result != HAL_OK)
        this->inError = true;
    return this->inError;
}

bool Stm32DebugOutput::send(const char* text) {
    return this->send(reinterpret_cast<const uint8_t*>(text), strlen(text));
}

#ifdef USE_ALLOCATION
bool send(const std::string& text) {
    return this->send(text.c_str());
}
#endif

Stm32DebugOutput Stm32DebugOutput::instance=Stm32DebugOutput();